# UpdateSummary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PathOfTravelFailures..::..UpdateSummary Property
BuiltInFailures..::..PathOfTravelFailures Class See Also
---
[Number] Path of Travel lines successfully updated. [Number] Path of Travel lines failed to update.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UpdateSummary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UpdateSummary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UpdateSummary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PathOfTravelFailures Class
Autodesk.Revit.DB Namespace